CSI API ETABS v1
cAreaObj.GetRebarDataSpandrel Method
 Retrieves rebar data for an area spandrel object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetRebarDataSpandrel(
	string Name,
	ref int NumberRebarLayers,
	ref string[] LayerID,
	ref eWallSpandrelRebarLayerType[] LayerType,
	ref double[] ClearCover,
	ref int[] BarSizeIndex,
	ref double[] BarArea,
	ref double[] BarSpacing,
	ref int[] NumberBars,
	ref bool[] Confined
)
Function GetRebarDataSpandrel (
	Name As String,
	ByRef NumberRebarLayers As Integer,
	ByRef LayerID As String(),
	ByRef LayerType As eWallSpandrelRebarLayerType(),
	ByRef ClearCover As Double(),
	ByRef BarSizeIndex As Integer(),
	ByRef BarArea As Double(),
	ByRef BarSpacing As Double(),
	ByRef NumberBars As Integer(),
	ByRef Confined As Boolean()
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim NumberRebarLayers As Integer
Dim LayerID As String()
Dim LayerType As eWallSpandrelRebarLayerType()
Dim ClearCover As Double()
Dim BarSizeIndex As Integer()
Dim BarArea As Double()
Dim BarSpacing As Double()
Dim NumberBars As Integer()
Dim Confined As Boolean()
Dim returnValue As Integer
returnValue = instance.GetRebarDataSpandrel(Name,
	NumberRebarLayers, LayerID, LayerType,
	ClearCover, BarSizeIndex, BarArea,
	BarSpacing, NumberBars, Confined)
int GetRebarDataSpandrel(
	String^ Name,
	int% NumberRebarLayers,
	array<String^>^% LayerID,
	array<eWallSpandrelRebarLayerType>^% LayerType,
	array<double>^% ClearCover,
	array<int>^% BarSizeIndex,
	array<double>^% BarArea,
	array<double>^% BarSpacing,
	array<int>^% NumberBars,
	array<bool>^% Confined
)
abstract GetRebarDataSpandrel :
        Name : string *
        NumberRebarLayers : int byref *
        LayerID : string[] byref *
        LayerType : eWallSpandrelRebarLayerType[] byref *
        ClearCover : float[] byref *
        BarSizeIndex : int[] byref *
        BarArea : float[] byref *
        BarSpacing : float[] byref *
        NumberBars : int[] byref *
        Confined : bool[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing area object
NumberRebarLayers
Type: System.Int32
LayerID
Type: System.String[]
LayerType
Type: ETABSv1.eWallSpandrelRebarLayerType[]
ClearCover
Type: System.Double[]
BarSizeIndex
Type: System.Int32[]
BarArea
Type: System.Double[]
BarSpacing
Type: System.Double[]
NumberBars
Type: System.Int32[]
Confined
Type: System.Boolean[]
Return Value
Type: Int32
Remarks
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace